# Kadir Berat YILDIRIM 090150122

## Pandas Library

### Series

In [1]:
import pandas as pd

from pandas import Series, DataFrame
obj = Series([3, 7, -5, 3])

In [2]:
obj

0    3
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 3,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
list(obj.index)

[0, 1, 2, 3]

In [6]:
type(obj.values)

numpy.ndarray

Index olarak arzu edilen harf veya sayılar kullanılabilir.

In [7]:
obj2 = Series([4, 7, -5, 3], index = ["d", "b", "a", "c"])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2.index[0]

'd'

In [11]:
obj.index[1]

1

In [12]:
obj2["a"]

-5

In [13]:
obj2["d"]

4

In [14]:
obj2[["d", "a", "b"]]

d    4
a   -5
b    7
dtype: int64

In [15]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [16]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
"b" in obj2

True

In [19]:
"e" in obj2

False

Dictionary'ler Series aracılığı ile, index'in olarak key değerleri kullanılarak tuple'lara dönüştürülebilir.

In [20]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [21]:
obj3 = Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

İstenen index isimleri ile ve eski bir data set ile yeni bir seri oluşturulabilir. Eski datada olmayan değerler NaN olarak bırakılacaktır. Eski datada olmayan indexler ise alınmayacaktır.

In [23]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [24]:
obj4 = Series(sdata, index = states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

***

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj4.name = 'population'

In [33]:
obj4.index.name = 'state'

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj4.rename("people")

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: people, dtype: float64

***

### DataFrame

#### Constructing a DataFrame

Dictionary'ler kolayca pandas DataFrame'e dönüştürülebilir.

In [36]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year':[1995, 2000, 2005, 2000, 2005], 'pop':[1.5, 1.7, 3.6, 2.4, 2.9]}

In [37]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [1995, 2000, 2005, 2000, 2005],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [38]:
frame = DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  1995  1.5
1    Ohio  2000  1.7
2    Ohio  2005  3.6
3  Nevada  2000  2.4
4  Nevada  2005  2.9

In [40]:
DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  1995    Ohio  1.5
1  2000    Ohio  1.7
2  2005    Ohio  3.6
3  2000  Nevada  2.4
4  2005  Nevada  2.9

Yeni bir column eklenebilir. Eklenen column için data verilmezse, NaN değerleri ile oluşturulur.

In [41]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five'])

In [42]:
frame2

       year   state  pop debt
one    1995    Ohio  1.5  NaN
two    2000    Ohio  1.7  NaN
three  2005    Ohio  3.6  NaN
four   2000  Nevada  2.4  NaN
five   2005  Nevada  2.9  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [48]:
frame2["year"]

one      1995
two      2000
three    2005
four     2000
five     2005
Name: year, dtype: int64

In [49]:
frame2.year

one      1995
two      2000
three    2005
four     2000
five     2005
Name: year, dtype: int64

In [50]:
frame2

       year   state  pop debt
one    1995    Ohio  1.5  NaN
two    2000    Ohio  1.7  NaN
three  2005    Ohio  3.6  NaN
four   2000  Nevada  2.4  NaN
five   2005  Nevada  2.9  NaN

In [51]:
frame2.iloc[0:1]

     year state  pop debt
one  1995  Ohio  1.5  NaN

In [52]:
frame2.loc['three']

year     2005
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [53]:
frame2.iloc[0: 2]

     year state  pop debt
one  1995  Ohio  1.5  NaN
two  2000  Ohio  1.7  NaN

In [54]:
frame2["debt"] = 16.7

In [55]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5  16.7
two    2000    Ohio  1.7  16.7
three  2005    Ohio  3.6  16.7
four   2000  Nevada  2.4  16.7
five   2005  Nevada  2.9  16.7

In [56]:
frame2["debt"] = np.arange(5)

In [57]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5     0
two    2000    Ohio  1.7     1
three  2005    Ohio  3.6     2
four   2000  Nevada  2.4     3
five   2005  Nevada  2.9     4

Dikkat! np.arange de kullanılan girdi ile dataframe length'i eşit olmalı!

***

In [58]:
val = Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [59]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [60]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5     0
two    2000    Ohio  1.7     1
three  2005    Ohio  3.6     2
four   2000  Nevada  2.4     3
five   2005  Nevada  2.9     4

In [61]:
frame2["debt"] = val

In [62]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5   NaN
two    2000    Ohio  1.7  -1.2
three  2005    Ohio  3.6   NaN
four   2000  Nevada  2.4  -1.5
five   2005  Nevada  2.9  -1.7

In [63]:
frame2['eastern'] = frame2.state == 'Ohio'

In [64]:
frame2

       year   state  pop  debt  eastern
one    1995    Ohio  1.5   NaN     True
two    2000    Ohio  1.7  -1.2     True
three  2005    Ohio  3.6   NaN     True
four   2000  Nevada  2.4  -1.5    False
five   2005  Nevada  2.9  -1.7    False

In [65]:
del frame2['eastern']

In [66]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5   NaN
two    2000    Ohio  1.7  -1.2
three  2005    Ohio  3.6   NaN
four   2000  Nevada  2.4  -1.5
five   2005  Nevada  2.9  -1.7

***

#### Nested Dictionaries to DataFrames

In [67]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9}, 'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}

In [68]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [69]:
frame3 = DataFrame(pop)

In [70]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [71]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64')

In [73]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [74]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [75]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [76]:
frame2

       year   state  pop  debt
one    1995    Ohio  1.5   NaN
two    2000    Ohio  1.7  -1.2
three  2005    Ohio  3.6   NaN
four   2000  Nevada  2.4  -1.5
five   2005  Nevada  2.9  -1.7

In [77]:
frame2.values

array([[1995, 'Ohio', 1.5, nan],
       [2000, 'Ohio', 1.7, -1.2],
       [2005, 'Ohio', 3.6, nan],
       [2000, 'Nevada', 2.4, -1.5],
       [2005, 'Nevada', 2.9, -1.7]], dtype=object)

In [80]:
d = {'one' : pd.Series([1., 2., 3.], index = ['a', 'b', 'c']), 'two' : pd.Series([1., 2., 3., 4.], index = ['a', 'b', 'c', 'd'])}

In [81]:
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64, 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [82]:
df = pd.DataFrame(d)

In [83]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [84]:
pd.DataFrame(d, index = ['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [85]:
pd.DataFrame(d, index = ['d', 'b', 'a'], columns = ['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

***

In [86]:
data2 = [{'a' : 1, 'b' : 2}, {'a' : 5, 'b' : 10, 'c' : 20}]

In [87]:
data2

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [88]:
data2[0]

{'a': 1, 'b': 2}

In [89]:
data2[0]["a"]

1

In [90]:
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [95]:
data2 = [{'a' : 1, 'b' : 2}, {'a' : 5, 'b' : 10, 'c' : 20}, {'a' : 51, 'b' : 30}]

In [96]:
pd.DataFrame(data2)

    a   b     c
0   1   2   NaN
1   5  10  20.0
2  51  30   NaN

In [93]:
data2 = [{'a' : 1, 'b' : 2}, {'a' : 5, 'b' : 10, 'c' : 20}, {'a' : 51, 'd' : 30}]

In [94]:
pd.DataFrame(data2)

    a     b     c     d
0   1   2.0   NaN   NaN
1   5  10.0  20.0   NaN
2  51   NaN   NaN  30.0

In [97]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [98]:
obj

a    0
b    1
c    2
dtype: int64

In [99]:
index = obj.index

In [100]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [102]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [103]:
'Ohio' in frame3.columns

True

In [104]:
2003 in frame3.index

False

In [105]:
2002 in frame3.index

True

In [107]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [108]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

***

#### Reindexing

In [109]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [110]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [111]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [112]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

In [113]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [114]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [115]:
frame = DataFrame(np.arange(9).reshape([3, 3]), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [116]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [117]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [118]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [119]:
frame.reindex(columns = ['Texas', 'Utah', 'California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [120]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [121]:
states

['California', 'Ohio', 'Oregon', 'Texas']

In [122]:
frame.reindex(index=["a","b","c","d"],columns=states)

   California  Ohio  Oregon  Texas
a         2.0   0.0     NaN    1.0
b         NaN   NaN     NaN    NaN
c         5.0   3.0     NaN    4.0
d         8.0   6.0     NaN    7.0

In [123]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

In [124]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [125]:
new_obj = obj.drop("c")

In [126]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [127]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

***

#### Dropping Entries from an Axis

In [128]:
data = DataFrame(np.arange(16).reshape((4, 4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.drop(["Colorado", 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [133]:
data.drop('two')

KeyError: "['two'] not found in axis"

Yukarıda görüldüğü gibi, column atılacağı zaman axis belirtilmeli!

In [134]:
data.drop(["two", "four"], axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [135]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [136]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [137]:
obj['b']

1.0

In [138]:
obj[1]

1.0

In [139]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [140]:
obj[['b', 'c', 'a']]

b    1.0
c    2.0
a    0.0
dtype: float64

In [141]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [142]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [143]:
obj['b':'c'] = 5

In [144]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

***

In [145]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [146]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [147]:
data > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [148]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data[data < 5] = 0

In [150]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [151]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [152]:
data.loc['Colorado':]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [153]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [154]:
data.loc[:'Utah', 'two':]

          two  three  four
Ohio        0      0     0
Colorado    5      6     7
Utah        9     10    11

In [155]:
data.loc[:'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [156]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [157]:
data.loc[data.three > 5, :]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [158]:
data.three > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [159]:
data.loc['Ohio'] > 1

one      False
two      False
three    False
four     False
Name: Ohio, dtype: bool

In [160]:
data.loc[:, data.loc['Ohio'] > 1]

Empty DataFrame
Columns: []
Index: [Ohio, Colorado, Utah, New York]